import { Question } from '../models/question.model';

export const QUESTIONS: Question[] = [
  {
    caption: 'כמה ימי הולדת היו לך עד היום?',
    answers: ['26', '37', '48', '59'],
    correctIndex: 2,
  },
  {
    caption: 'בעוד שמונה ימי הולדת בת כמה תהיי?',
    answers: ['26', '37', '48', '59'],
    correctIndex: 0,
  },
  {
    caption: 'מאחד עד 10 כמה את אוהבת ימי הולדת?',
    answers: ['3', '7', '9', '10'],
    correctIndex: 3,
  },
  {
    caption: 'בכמה חוגים אלעד היה עד היום?',
    answers: ['10', '9', '5', '12'],
    correctIndex: 1,
  },
  {
    caption: 'איך את קוראת לאלעד - השם הראשי?',
    answers: ['נאקי', 'פוצי', 'לולי', 'אלעדי'],
    correctIndex: 0,
  },
  {
    caption: 'כמה פעמים אמא ומילי מדברות בטלפון בשבוע?',
    answers: [
      'כל יום פעם אחת',
      'פעם בשבוע',
      'יום כן יום לא',
      'יותר מדי פעמים ביום',
    ],
    correctIndex: 3,
  },
  {
    caption: `איך מכינים צ'יפס טעים?`,
    answers: [
      'קצת שמן, טיפה סוכר, הרבה מלח, ולעסות',
      'קוראים לקובי ואומרים "אל תכין בטח אין לך כח"',
      'לא משנה, אני בחיים לא אזכור',
      'כל התשובות נכונות',
    ],
    correctIndex: 3,
  },
  {
    caption: 'איזה צבע את אוהבת הכי הרבה?',
    answers: ['רק ירוק', 'או כחול או סגול', 'סגול', 'כחול'],
    correctIndex: 2,
  },
  {
    caption: 'איך קוראים לחומר השביר השקוף שממנו עושים כוסות וצלחות?',
    answers: ['זכוכית', 'זרוכית', 'סכוכית', 'סרוחית'],
    correctIndex: 3,
  },
  {
    caption: 'מי אוהב אותך יותר ממני?', 
    answers: [
        'איך אפשר בכלל?', 
        'עוד לא המציאו', 
        'צריך שיא חדש בשביל שזה יקרה',
        'כל התשובות נכונות ועוד קצת'
    ], 
    correctIndex: 3
  }
];
